<!DOCTYPE html>
<html lang="ja">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <meta name="description" content="自作万年カレンダー">
    <title>自作万年カレンダー</title>
    <link rel="stylesheet" href="style.css">
</head>

<?php include 'header.php'; ?>

<div class="container">
    <main class="main-content">



        <!--

万年カレンダー作成 （前提として1600年1月1日（土）を基準して考えてます）

また各所にコードを書くと競合してしまう為、
本文は上の方へ、動作チェックなどのスクリプト本体は下の方へ記述しています。
さらに、ウェブページ用にマークアップすると見にくくなる為
必要最低限のHTML記述にしてあります。

//=======================================================================
ステップ1（1～30まで表示させる）
ステップ2（うるう年判定）
ステップ3（うるう年の回数）
ステップ4（合計日数を出す）
ステップ5（曜日を割り出す）
ステップ6 カレンダーの日数を出力する(横一列)
ステップ7 ブラウザ上に必要なボタンを部品を用意する。
ステップ8：ボタンを押したときに動く「関数」の枠組み
ステップ9：ボタンが押された時に、入力された年月をJavaScriptに読み込む
ステップ10：各月の末日（最終日）の配列を用意する
ステップ11：入力された年が「うるう年」か判定し、2月を書き換える
ステップ12：1600年から「指定された年の前年まで」のうるう年と年間日数を数える
ステップ13 1月1日以降の日数を足し算する
ステップ14 曜日を合計日数から割り出す
ステップ15 カレンダーの出力
ステップ16 ブラウザ上にカレンダーを表示させる。
==========================================================================//


📝------------------------------------------------------------------
ステップ1（1～30まで表示させる）
------------------------------------------------------------------//

<script>

for(let i = 1 ; i <= 30 ; i++ ){
    console.log(i); 
}

</script>


📝------------------------------------------------------------------
ステップ2（うるう年判定）
------------------------------------------------------------------//
うるう年の条件
1.4で割り切れる
3.400で割り切れるは、うるう年。

<script>

let year = 2026; // あとでユーザーが入力する箇所

// 「400で割り切れる」 または 「4で割り切れて、かつ100で割り切れない」
if (year % 400 === 0 || (year % 4 === 0 && year % 100 !== 0)) {
    console.log("うるう年");
} else {
    console.log("平年");
}

</script>


📝------------------------------------------------------------------
ステップ3（うるう年の回数）
------------------------------------------------------------------//

ステップの2で作成した条件でtrue判定を数えたらいいので、

1600年から今の年（let year = 2026;）までループさせて
もし、うるう年ならカウントするような形を作ればよい。

<script>

let count = 0; // うるう年の回数を数える箱を準備しておく。

for (let y = 1600; y < 2026; y++) {        // 1600年から入力された年まで1年ずつ繰り返す
    
    // もし、その年（y）がうるう年だったら…（ステップ2の条件を利用）
    if (y % 400 === 0 || (y % 4 === 0 && y % 100 !== 0)) {
        count = count + 1; // 用意した箱に該当する年をカウント（+1）していく。
    }
}
console.log("1600年から2026年までのうるう年は全部で " + count + " 回です"); //  結果104回

</script>

📝------------------------------------------------------------------
ステップ4（合計日数を出す）
------------------------------------------------------------------//

===（考え方 A）===うるう年とうるう年じゃない年の数で計算

うるう年（1年間366日）の回数がわかった→104回
2026 - 1600 = 426年がトータルの年数なので
うるう年    104回（366日）
平年        322回（365日）
104回 × 366日 + 322回 × 365回 = 155594日
1600年1月1日から2026年1月1日までの日数は、155,594日


===（考え方 B）===とりあえず365日×年数で後からうるう年の日数分を足す計算

うるう年の回数が分かれば、その年数分、1日多くしたら良いので
トータルの年数×365+うるう年の回数×1日でも求められる。
トータルの年数が426年で、うるう年がその内104回（1日多い）
426年 × 365日 + 104日  = 155594日


ここで関係性を変数名に意味を持たせて扱いやすくする為
count（うるう年をカウントしてた）はわかりやすく
以後、次のように考える。

uru_year    （うるう年）
uru_not_year（うるう年じゃない年）


<script>
let year = 2026;        //ユーザー入力もしくは現在の年
let uru_year = 0;       //入力によって決まる
let uru_not_year = 0;   //入力によって決まる
let Total_days =0;      //合計日数


for (let y = 1600; y < year; y++) {
    if (y % 400 === 0 || (y % 4 === 0 && y % 100 !== 0)) {
        uru_year++;             // 記述はどれも同じ意味 uru_year = uru_year + 1 （代入演算子+算術演算子）
    } else {                    // 記述はどれも同じ意味 uru_year += 1           （複合代入演算子）
        uru_not_year++;         // 記述はどれも同じ意味 uru_year++    📝最も多い（インクリメント演算子）
    }
}

console.log("うるう年の回数: " + uru_year);
console.log("平年の回数: " + uru_not_year);
Total_days = (uru_year * 366) + (uru_not_year * 365);
console.log("1600年1月1日からの合計日数: " + Total_days);

</script>

📝------------------------------------------------------------------
ステップ5（曜日を割り出す）
------------------------------------------------------------------//


1週間は7日あるので、7で割った余りで表現できる。
今回は1600年1月1日（土）が基準になるので基準を土曜に置く。 
7で割った「あまり（余り）」を計算して、youbi という箱に入れる
7/7＝余り0, 1/7＝余り1, 2/7＝余り2,・・・

<script>

let youbi = Total_days % 7;
// 余りの数字（0〜6）に合わせて、曜日を判定する
if (youbi === 0) {
    console.log("その日は【土曜日】です！"); 
} else if (youbi === 1) {
    console.log("その日は【日曜日】です！");
} else if (youbi === 2) {
    console.log("その日は【月曜日】です！");
} else if (youbi === 3) {
    console.log("その日は【火曜日】です！");
} else if (youbi === 4) {
    console.log("その日は【水曜日】です！");
} else if (youbi === 5) {
    console.log("その日は【木曜日】です！");
} else if (youbi === 6) {
    console.log("その日は【金曜日】です！");
}

</script>

📝------------------------------------------------------------------
ステップ6 カレンダーの日数を出力する(横一列)
------------------------------------------------------------------//

【水曜日（曜日番号 4）が1日の場合のイメージ】
 [日(1)] [月(2)] [火(3)] [水(4)] [木(5)] [金(6)] [土(0)]
   └─ 空っぽのマス ─┘    1日     2日     3日     4日

 例：1日が水曜日（曜日番号 4）の場合
// 日(1)・月(2)・火(3) の「3マス分」を空っぽにしたいので、4未満の間繰り返す

<script>

for (let i = 1; i < 4; i++) {
    console.log("【空マス】");
}
let endDay = 30; // 例：その月が30日まである場合

for (let day = 1; day <= endDay; day++) {
    console.log(day + "日");
}

</script>

📝------------------------------------------------------------------
ステップ7 ブラウザ上に必要なボタンを部品を用意する。
------------------------------------------------------------------//
後々部品は呼出しを行うのでid名を付けておく

    <h1>万年カレンダー</h1>
    <input id="year" type="text" placeholder="西暦を入力"> 年
    <input id="month" type="text" placeholder="月を入力"> 月
    <button id="btn">カレンダーを表示</button>



📝------------------------------------------------------------------
ステップ8：ボタンを押したときに動く「関数」の枠組み
------------------------------------------------------------------//

clickを使した時に、カレンダーを表示させる命令

<script>

const btn = document.getElementById("btn"); //htmlからbtnを呼出して、箱にいれる
btn.addEventListener("click", (e)=>{        //e.target と addEventListener の知識必須
    console.log("ボタンが押された！");
});
*/
</script>

📝------------------------------------------------------------------
ステップ9：ボタンが押された時に、入力された年月をJavaScriptに読み込む
------------------------------------------------------------------//
補足：入力フォームに,ユーザーが入力する値は全て文字列とブラウザは認識する為
    入力された値を数字と認識させる為に「parseInt」で囲う必要がある。

補足：ユーザーが入力した値を引っ張り出すので「value」を使います。
    仮にvalueがないと、yearを呼込んでしまい、idのinput自体が返される事となり
    console.log(is_year)で結果は&lt;input id="year" type="text"&gt;が出てきます。

補足：ボタンの呼び出し関数ですが、方法が3通りほどある。なので、ここで作成者によって、分岐してくる所かも？
    （今回はこのやり方→）⓵addEventListener方式現代のプログラミングで最もよく使われる、一番きれいで安全な書き方。HTMLを汚さない。
    ⓶onclickプロパティ方式JavaScript側だけで完結する。少し昔ながらの書き方。先生のコードの最後でも使用されいる。
    ⓷HTMLインライン方式HTMLのボタンタグの中に直接、命令の名前を書き込む書き方。直感的に一番わかりやすい。


<script>
btn.addEventListener("click", (e)=>{
    console.log("ボタンが押された！");
    
    // 入力された年を拾ってくる。
    const is_year = parseInt(document.getElementById("year").value); 
    console.log(is_year);   //ブラウザから入力なしだとNaNが返ってくる。

    // 入力された月を拾ってくる。
    const is_month = parseInt(document.getElementById("month").value);
    console.log(is_month);  //ブラウザから入力なしだとNaNが返ってくる。
});
</script>

📝------------------------------------------------------------------
ステップ10：各月の末日（最終日）の配列を用意する
------------------------------------------------------------------//

各月の末日は、決まっているので、その配列を作る。

豆知識：西向く士侍 → 2（に）・4（し）・6（む）・9（く）・11（士＝侍）で、31日ではない月（30日以下の月）を覚えられます。
        2月はうるう年で誰もが知っているので、例外として考えたら、覚えやすいです。

1月から、31.28.31.30.31.30.31.31.30.31.30.31
2月だけ、うるう年が29になる。2月は後ほど修正するとして配列は

    配列を平年とうるう年の2つ作って、カレンダーも作れる（ここも作成者によって分岐するかも）
    ただし、長い配列を書く手間が増えてしまい あまり好まれるやり方ではない。コードも少し長なってしまいます。


⓵let month_days =[31,28,31,30,31,30,31,31,30,31,30,31];

    配列は要素0番目からカウントするので
    実際にユーザーが1と入力した場合、要素1（28日）を呼出してしまうので
    入力値（is_month）に対して-1する必要がある。
    つまり

⓶console.log(month_days[is_month - 1]); 

この⓵と⓶の記述は、ボタンがクリックされた（イベント）時に呼出される必要があるので
ステップ8のイベントの中にいれなければなりません。
つまり以下の通り。

<script>
/*
btn.addEventListener("click", (e)=>{
    console.log("ボタンが押された！");
    
    // 入力された年を拾ってくる。
    const is_year = parseInt(document.getElementById("year").value); 
    console.log(is_year);   //ブラウザから入力なしだとNaNが返ってくる。

    // 入力された月を拾ってくる。
    const is_month = parseInt(document.getElementById("month").value);
    console.log(is_month);  //ブラウザから入力なしだとNaNが返ってくる。

    let month_days =[31,28,31,30,31,30,31,31,30,31,30,31];   //⓵追加
    console.log(month_days[is_month - 1]);                   //⓶追加

});
*/
</script>

📝------------------------------------------------------------------
ステップ11：入力された年が「うるう年」か判定し、2月を書き換える
------------------------------------------------------------------//

まずはステップ2で作った判定式を使います。


let year = 2026;

if (year % 400 === 0 || (year % 4 === 0 && year % 100 !== 0)) {
    console.log("うるう年");
} else {
    console.log("平年");
}

うるう年のならば、配列を書き換える。
元の配列を残しつつ変える必要があると、思いきや
ボタンをクリックする度にリセットされるので、配列は今この瞬間変えるだけで問題ない。
つまり配列の書き換えは month_days=29; で表現できる。
⚠️valueで取得したデータで判定を行うので上記の「year」を「is_year」に替えます。
つまり

<script>
if (is_year % 400 === 0 || (is_year % 4 === 0 && is_year % 100 !== 0)) {      
    console.log("うるう年");
    month_days[1]=29;            //配列の要素1番目を29に書き換える
    console.log(month_days);    //配列が変わっているか確認をする（うるう年をブラウザから入力する）
} else {
    console.log("平年");
} 
</script>  

そしてさらに、判定し書き換える上のif文を
ステップ9の「console.log(month_days[is_month - 1]);」続きに放り込みます。

📝------------------------------------------------------------------
ステップ12：1600年から入力された年数までの、うるう年の回数と年間日数を数える
------------------------------------------------------------------//
let uru_year = 0;   //カウントする為の箱の準備

for(let y = 1600 ; y < is_year  ; y++ ){                    //入力される年数に対し基準とする1600年から1年ごと探る    
    if(y % 400 === 0 || (y % 4 === 0 && y % 100 !== 0)){    //400で割れる、または、4で割れて100で割れない
        uru_year++;                                         //うるう年カウント
    } else {
        uru_not_year++;                                     //それ以外カウント
}
console.log(`1600年から前年までのうるう年の回数:${uru_year}`);  //デバック確認の為、用意。

📝------------------------------------------------------------------
ステップ13 1月1日以降の日数を足し算する
------------------------------------------------------------------//
まずステップ10をヒントに
let month_days =[31,28,31,30,31,30,31,31,30,31,30,31];


===============（考え方 A（自分はこっちの考え方だった））============
ユーザーが月を入力したら、〇月とわかるので、その該当月の前から1月まで遡って足せばよい。
入力が5月なら、4月.3月.2月.1月を足せばいいという考え方。

<script>
// 変数 i を「指定月の前月の部屋番号」にして、要素が0以上である間、1ずつ減らしながら繰り返す

for (let i = is_month - 2; i >= 0; i--) {            //s_month - 2 は入力されたデータが仮に2月なら1月まで足したい。
    Total_days = Total_days + month_days[i];         //つまり配列[0]番目。なので-2にする必要がある。
}                                                    //1月が入力されたら i >= 0 というルールがあるので問題ない。                      
console.log(`今年の指定月1日までの総合計日数:${Total_days}`);
</script>


===============（考え方 B （先生はこっちの考え方だった））===============
ユーザーが月を入力したら、〇月とわかるので、1月～〇月の前の月まで足せばよい。
入力が5月なら、1月.2月.3月.4月を足せばいいという考え方。

<script>
// 変数 m を「0（1月）」からスタートして、「指定月の前月」まで1ずつ増やしながら繰り返す
for (let m = 0; m < is_month - 1; m++) {
    // 今の合計日数に、終わった月の末日をそのままドンドン足していく！
    Total_days = Total_days + month_days[m]; 
}
console.log(`今年の指定月1日までの総合計日数:${Total_days}`);
</script>

📝------------------------------------------------------------------
ステップ14 曜日を合計日数から割り出す
------------------------------------------------------------------//
ステップ5ですでにTotal_daysで記述しているので、そのまま使う。
<script>

let youbi = Total_days % 7;

// 余りの数字（0〜6）に合わせて、曜日を判定する
if (youbi === 0) {
    console.log("その日は【土曜日】です！"); 
} else if (youbi === 1) {
    console.log("その日は【日曜日】です！");
} else if (youbi === 2) {
    console.log("その日は【月曜日】です！");
} else if (youbi === 3) {
    console.log("その日は【火曜日】です！");
} else if (youbi === 4) {
    console.log("その日は【水曜日】です！");
} else if (youbi === 5) {
    console.log("その日は【木曜日】です！");
} else if (youbi === 6) {
    console.log("その日は【金曜日】です！");
}

</script>

📝------------------------------------------------------------------
ステップ15 カレンダーの出力
------------------------------------------------------------------//
ステップ6をヒントする。
年数と月が入力されると、その月のスタート（youbi）がわかります。
2026年9月は火曜日です。というように。
また、ステップ13で、youbi === 0 は土曜日といってます。

1.まず空マスを求める

もし、何曜日なら何マス開ける。というような考え方をすると。

【水曜日なら3つ開ける】
 [日(1)] [月(2)] [火(3)] [水(4)] [木(5)] [金(6)] [土(0)]
   └─ 空っぽのマス ─┘    1日     2日     3日     4日


土曜日（youbi === 0） のとき ── 空マスは 6 つ
金曜日（youbi === 6） のとき ── 空マスは 5 つ
木曜日（youbi === 5） のとき ── 空マスは 4 つ
水曜日（youbi === 4） のとき ── 空マスは 3 つ
火曜日（youbi === 3） のとき ── 空マスは 2 つ
月曜日（youbi === 2） のとき ── 空マスは 1 つ
日曜日（youbi === 1） のとき ── 空マスは 0 つ

つまり 空のマス（kara）は youbiから-1すると空マスの数に相当します。
土曜日は例外になるので

もし、曜日が土曜日だけ6マスあけるけど、
それ以外は曜日（youbi）から-1した数字（空マス相当）という思考を、式で表すと・・・

<script>
let kara;

if(youbi === 0){
    kara = 6;           //youbiが0、つまり土曜日ならkaraは6
} else {
    kara =youbi - 1;    //それ以外なら曜日番号-1
}
</script>

と表す事ができます。

2.次にスタートする1日の置き場所を決めます。

ステップ6では横一列に1.2.3.4.5.6.7.8.9.10---という感じで表示されます。
空マスを用意したとて、例えば水曜スタートと分かっても4日スタートになってしまう。
実際には数字は下のような動きになるので、曜日に合わせて日付も動かす必要があります。

 日    月     火    水    木   金    土
【空】【空】 【空】 【】  【】  【】  【】
 1日   2日   3日   4日   5日   6日   7日

 なので曜日番号から日付を割り出すとしたら
 （基準はどこにおいても最終結果は同じです）

土曜日（youbi === 0） のとき ──＞7日なので1日にするには   -6日付をずらす
金曜日（youbi === 6） のとき ──＞6日なので1日にするには   -5日付をずらす
木曜日（youbi === 5） のとき ──＞5日なので1日にするには   -4日付をずらす
水曜日（youbi === 4） のとき ──＞4日なので1日にするには   -3日付をずらす
火曜日（youbi === 3） のとき ──＞3日なので1日にするには   -2日付をずらす
月曜日（youbi === 2） のとき ──＞2日なので1日にするには   -1日付をずらす
日曜日（youbi === 1） のとき ──＞1日なので1日にするには    0日付をずらす

よって、まとめると・・・

<script>
let day_shift = 0; // 日曜日からどれだけズラすか
(少し疑問かもしれませんが、先ほどyoubi配列要素の0を基準に考えているので変数は0にしてます)
(当然基準が異なれば定数は0に限らず、1でも大丈夫だったりします。極論、経過で修正はいくらでもできます。)

     if (youbi === 0) { day_shift = -6; } // 土曜日のとき
else if (youbi === 6) { day_shift = -5; } // 金曜日のとき
else if (youbi === 5) { day_shift = -4; } // 木曜日のとき
else if (youbi === 4) { day_shift = -3; } // 水曜日のとき
else if (youbi === 3) { day_shift = -2; } // 火曜日のとき
else if (youbi === 2) { day_shift = -1; } // 月曜日のとき
else if (youbi === 1) { day_shift = 0;  } // 日曜日のとき

// カレンダーの最初のマスの日付（day）を決めます
// ズレの数字に「1日」をプラスする。（基準を0日に考えてしまった為、手間が増えてしまった。）

let day = 1 + day_shift; 
let end_day = month_days[is_month - 1]; // その月の末日
</script>

📝------------------------------------------------------------------
ステップ16 ブラウザ上にカレンダーを表示させる。
------------------------------------------------------------------//
ステップ6で準備したtableを組んでいく。

まず、table の基本構造から再確認

<table>
  <tr> ---------------行（横列）
    <th>見出し1</th> --列（縦列）見出しには、曜日を埋めていく。
    <th>見出し2</th>
  </tr>
  <tr> ---------------行（横列）
    <td>データ1</td> --列（縦列）データには、日付を埋めていく。
    <td>データ2</td>
  </tr>
</table>

1.javascriptで生成されるtableの保存場所を作っておく。 box_tableと名前を付ける。
2.先に固定できる見出しを作成する。あとから、タグをループで繋げる為、演算式で+を入れる。
3.日付が月末日を超えるまでループさせる。かつ1週間毎（7回）で行を作る必要がある。

<script>

let box_table = "";
box_table += "<tr><th>日</th><th>月</th><th>火</th><th>水</th><th>木</th><th>金</th><th>土</th></tr>";

while (day <= end_day) {                     // 末日までループ
    box_table += "<tr>";                     // 行作成

    for (let i = 0; i < 7; i++) {            // 1週間分のループ処理7回
        if (day < 1 || day > end_day) {      // ただし、日付が0以下または、日付が月末日より大きくなったら
            box_table += "<td></td>";        // 空マスを入れる。
        } else {
            box_table += "<td>" + day + "</td>"; // 日付（データ）を入れる
        }
        day++;                                  // 1マス作るごとに1日進める
    }                                           //1週間分（7回）のループが終了

    box_table += "</tr>";                       // 1週間分が終わったら行を閉じる
} 

// 完成したテーブル（box_table）を画面の <table> タグの中に挿入する

document.getElementById("calendar").innerHTML = box_table;

</script>


-->
        <!-- 
    ======================================================================
                【リアルに動く画面パーツと本番プログラムの領域】
    ======================================================================
-->

        <!-- [ステップ6] のHTML部品 -->
        <h1>万年カレンダー</h1>
        <div class="input-area">
            <input id="year" type="text" placeholder="西暦を入力"> 年
            <input id="month" type="text" placeholder="月を入力"> 月
            <button id="btn">カレンダーを表示</button>
        </div>
        <h3>基本構成のみなので、前月、翌月の機能は実装しておりません。</h3>
        <p>補足1：年の入力値は基準1600年としているので、それ以上の数値を入力下さい。</p>
        <p>補足2：月の入力値は1～12月までなので、入れ以外の数字は回答がありません</p>
        <table id="calendar"></table>

        <script>
            let year; //ユーザー入力もしくは現在の年
            // [ステップ8] htmlからbtn呼出して、箱にいれる
            const btn = document.getElementById("btn");


            btn.addEventListener("click", (e) => {
                console.log("--- ボタンが押されました！ ---");

                // [ステップ9] 入力された年・月を拾って数字に変える
                const is_year = parseInt(document.getElementById("year").value);
                console.log("入力された年: " + is_year);

                const is_month = parseInt(document.getElementById("month").value);
                console.log("入力された月: " + is_month);

                // [ステップ10] 1月〜12月までの末日の配列（平年ベース）
                let month_days = [31, 28, 31, 30, 31, 30, 31, 31, 30, 31, 30, 31];

                // [ステップ11] うるう年か判定し、2月を書き換える
                if (is_year % 400 === 0 || (is_year % 4 === 0 && is_year % 100 !== 0)) {
                    console.log("うるう年");
                    month_days[1] = 29; // 配列の要素1番目を29に書き換える
                    console.log(month_days); // デバッグで2月入力時に変更されるか確認。
                } else {
                    console.log("平年");
                }

                // 該当の月の末尾が反映されているかテストする。尚下記の記述方法はテンプレートリテラルです。
                console.log(`${is_month}月の末日データ:${month_days[is_month - 1]}`);

                // [ステップ12]
                let uru_year = 0; // ⚠️ボタンの外に変数を置くと常に加算され続ける為、ボタンの処理の中にいれる必要がある。
                let uru_not_year = 0; // ⚠️ボタンの外に変数を置くと常に加算され続ける為、ボタンの処理の中にいれる必要がある。
                for (let y = 1600; y < is_year; y++) { //1600年～入力年数    
                    if (y % 400 === 0 || (y % 4 === 0 && y % 100 !== 0)) { //400で割れる、または、4で割れて100で割れない
                        uru_year++;
                    } else {
                        uru_not_year++;
                    }
                }
                console.log(`1600年から前年までのうるう年の回数:${uru_year}`); //うるう年の回数をデバックで確認
                let Total_days = (uru_year * 366) + (uru_not_year * 365);
                console.log(`1600年1月1日からの合計日数:${Total_days}`); //あくまで年間単位の日数1年分2年分という感じ

                // [ステップ13] 変数 i を「指定月の前月の要素」にして、0以上である間、1ずつ減らしながら繰り返す
                for (let i = is_month - 2; i >= 0; i--) {
                    // 年間日数に月の末日を足していく。
                    Total_days = Total_days + month_days[i];
                }
                console.log(`今年の指定月1日までの総合計日数:${Total_days}`); //総合計の日数をデバッグで確認

                // [ステップ14] 曜日を合計日数から割り出す
                let youbi = Total_days % 7;

                if (youbi === 0) {
                    console.log(`${is_year}年${is_month}月は土曜日です`);
                } else if (youbi === 1) {
                    console.log(`${is_year}年${is_month}月は日曜日です`);
                } else if (youbi === 2) {
                    console.log(`${is_year}年${is_month}月は月曜日です`);
                } else if (youbi === 3) {
                    console.log(`${is_year}年${is_month}月は火曜日です`);
                } else if (youbi === 4) {
                    console.log(`${is_year}年${is_month}月は水曜日です`);
                } else if (youbi === 5) {
                    console.log(`${is_year}年${is_month}月は木曜日です`);
                } else if (youbi === 6) {
                    console.log(`${is_year}年${is_month}月は金曜日です`);
                }
                //[ステップ15]
                let day_shift = 0; // 日曜日からどれだけズラすか

                if (youbi === 0) {
                    day_shift = -6;
                } // 土曜日のとき
                else if (youbi === 6) {
                    day_shift = -5;
                } // 金曜日のとき
                else if (youbi === 5) {
                    day_shift = -4;
                } // 木曜日のとき
                else if (youbi === 4) {
                    day_shift = -3;
                } // 水曜日のとき
                else if (youbi === 3) {
                    day_shift = -2;
                } // 火曜日のとき
                else if (youbi === 2) {
                    day_shift = -1;
                } // 月曜日のとき
                else if (youbi === 1) {
                    day_shift = 0;
                } // 日曜日のとき

                // カレンダーの最初のマスの日付（day）を決めます
                // ズレの数字に「1日」をプラスする。（基準を0日に考えてしまった為、手間が増えてしまった。）

                let day = 1 + day_shift;
                let end_day = month_days[is_month - 1]; // その月の末日

                console.log("スタート日: " + day);
                console.log("月末日: " + end_day);

                //[ステップ16]
                let box_table = "";
                box_table += "<tr><th>日</th><th>月</th><th>火</th><th>水</th><th>木</th><th>金</th><th>土</th></tr>";

                while (day <= end_day) { // 末日までループ
                    box_table += "<tr>"; // 行作成

                    for (let i = 0; i < 7; i++) { // 1週間分のループ処理7回
                        if (day < 1 || day > end_day) { // ただし、日付が0以下または、日付が月末日より大きくなったら
                            box_table += "<td></td>"; // 空マスを入れる。
                        } else {
                            box_table += "<td>" + day + "</td>"; // 日付（データ）を入れる
                        }
                        day++; // 1マス作るごとに1日進める
                    } //1週間分（7回）のループが終了

                    box_table += "</tr>"; // 1週間分が終わったら行を閉じる
                }

                // 完成したテーブル（box_table）を画面の <table> タグの中に挿入する

                document.getElementById("calendar").innerHTML = box_table;

            });
        </script>


    </main>
    <?php include 'history.php'; ?>
</div>

<a href="#" class="top-button" aria-label="ページトップへ戻る">▲ TOP</a>

</body>

</html>